FSLART/VCU_STM32_Firmware_V1/Core/Src/main.c
/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */

/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/

/* USER CODE BEGIN PV */

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MPU_Config(void);
/* USER CODE BEGIN PFP */
void HAL_ADC_ConvCpltCallback(ADC_HandleTypeDef *hadc) {
    // Process the data
}

// Timed task function declarations
void execute_10ms_tasks(void);
void execute_100ms_tasks(void);
void execute_immediate_tasks(void);
/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */

void CAN1_Filter_Config(void) {
    CAN_FilterTypeDef canfilterconfig;

    canfilterconfig.FilterActivation = CAN_FILTER_ENABLE;
    canfilterconfig.FilterBank = 0;
    canfilterconfig.FilterFIFOAssignment = CAN_RX_FIFO0;
    canfilterconfig.FilterIdHigh = 0x0000;  // Accept all IDs
    canfilterconfig.FilterIdLow = 0x0000;
    canfilterconfig.FilterMaskIdHigh = 0x0000;
    canfilterconfig.FilterMaskIdLow = 0x0000;
    canfilterconfig.FilterMode = CAN_FILTERMODE_IDMASK;
    canfilterconfig.FilterScale = CAN_FILTERSCALE_32BIT;

    if (HAL_CAN_ConfigFilter(&hcan1, &canfilterconfig) != HAL_OK) {
        Error_Handler();
    }
}

void CAN2_Filter_Config(void) {
    CAN_FilterTypeDef canfilterconfig;

    canfilterconfig.FilterActivation = CAN_FILTER_ENABLE;
    canfilterconfig.FilterBank = 14;
    canfilterconfig.FilterFIFOAssignment = CAN_RX_FIFO0;
    canfilterconfig.FilterIdHigh = 0x0000;  // Accept all IDs
    canfilterconfig.FilterIdLow = 0x0000;
    canfilterconfig.FilterMaskIdHigh = 0x0000;
    canfilterconfig.FilterMaskIdLow = 0x0000;
    canfilterconfig.FilterMode = CAN_FILTERMODE_IDMASK;
    canfilterconfig.FilterScale = CAN_FILTERSCALE_32BIT;

    if (HAL_CAN_ConfigFilter(&hcan2, &canfilterconfig) != HAL_OK) {
        Error_Handler();
    }
}

void CAN3_Filter_Config(void) {
    CAN_FilterTypeDef canfilterconfig;

    canfilterconfig.FilterActivation = CAN_FILTER_ENABLE;
    canfilterconfig.FilterBank = 0;
    canfilterconfig.FilterFIFOAssignment = CAN_RX_FIFO0;

    canfilterconfig.FilterIdHigh = 0x0000;  // Accept all IDs
    canfilterconfig.FilterIdLow = 0x0000;
    canfilterconfig.FilterMaskIdHigh = 0x0000;
    canfilterconfig.FilterMaskIdLow = 0x0000;

    canfilterconfig.FilterMode = CAN_FILTERMODE_IDMASK;
    canfilterconfig.FilterScale = CAN_FILTERSCALE_32BIT;

    if (HAL_CAN_ConfigFilter(&hcan3, &canfilterconfig) != HAL_OK) {
        Error_Handler();
    }
}

/* -------------------- SENSOR FUNCTIONS -------------------- */
/**
 * @brief Measure the brake pressure from an ADC reading
 * @param bits Raw ADC value (12-bit resolution, 0-4095)
 * @return Calculated brake pressure in bar
 * @details Converts ADC reading to voltage, then to pressure using calibration formula.
 *          Sensor characteristics: 28.57mV/bar with 0.5V offset (0 bar = 0.5V)
 */
float MeasureBrakePressure(uint16_t bits) {
    // Constants for clarity
    const float ADC_MAX = 4095.0f;
    const float MCU_VREF = 3.3f;             // MCU reference voltage
    const float SENSOR_VREF = 5.0f;          // Sensor reference voltage
    const float CONVERSION_FACTOR = 0.667f;  // Factor to convert 3.3V to 5V scale
    const float OFFSET_VOLTAGE = 0.5f;       // 0 bar = 0.5V
    const float SENSITIVITY = 0.02857f;      // 28.57mV/bar

    // Calculate voltage from ADC reading (0-3.3V range)
    float volts = (float)bits * MCU_VREF / ADC_MAX;

    // Scale to sensor voltage range (0-5V)
    volts = volts / CONVERSION_FACTOR;

    // Apply boundary checking for voltage
    if (volts < 0.0f) {
        volts = 0.0f;
    } else if (volts > SENSOR_VREF) {
        volts = SENSOR_VREF;
    }

    // Calculate pressure from voltage using calibration formula:
    // P(bar) = (V - 0.5V) / 0.02857V/bar
    float pressure = 0.0f;
    if (volts <= OFFSET_VOLTAGE) {
        pressure = 0.0f;  // Anything below offset voltage is 0 bar
    } else {
        pressure = (volts - OFFSET_VOLTAGE) / SENSITIVITY;
    }

    // Limit maximum pressure if needed
    const float MAX_PRESSURE = 100.0f;  // Maximum measurable pressure
    if (pressure > MAX_PRESSURE) {
        pressure = MAX_PRESSURE;
    }

    return pressure;  // Return the brake pressure in bar
}

/**
 * @brief Controls the brake light based on brake pressure
 * @param brake_pressure Current brake pressure in bar
 * @details Turns the brake light on when pressure exceeds minimum threshold
 *          and off when pressure falls below threshold
 */
void turn_on_brake_light(uint8_t brake_pressure) {
    // Define threshold for brake light activation (can be adjusted as needed)
    const uint8_t BRAKE_LIGHT_THRESHOLD = 5;  // bar

    // Check if brake pressure exceeds threshold
    if (brake_pressure >= BRAKE_LIGHT_THRESHOLD) {
        // Turn brake light on
        HAL_GPIO_WritePin(dout1_BMS_IGN_GPIO_Port, dout1_BMS_IGN_Pin, GPIO_PIN_SET);
    } else {
        // Turn brake light off
        HAL_GPIO_WritePin(dout1_BMS_IGN_GPIO_Port, dout1_BMS_IGN_Pin, GPIO_PIN_RESET);
    }
}

/**
 * @brief Initialize moving average buffers for APPS
 */
void MovingAverage_Init(void) {
    for (int i = 0; i < APPS_MA_WINDOW_SIZE; i++) {
        apps1_buffer[i] = 0;
        apps2_buffer[i] = 0;
    }
    apps_buffer_pos = 0;
    apps1_avg = 0;
    apps2_avg = 0;
}

/**
 * @brief Update moving average with new APPS values
 * @param apps1_raw Raw value from APPS1 sensor
 * @param apps2_raw Raw value from APPS2 sensor
 * @return None, updates apps1_avg and apps2_avg global variables
 */
void MovingAverage_Update(uint16_t apps1_raw, uint16_t apps2_raw) {
    // Add new values to buffers
    apps1_buffer[apps_buffer_pos] = apps1_raw;
    apps2_buffer[apps_buffer_pos] = apps2_raw;

    // Update position for next entry
    apps_buffer_pos = (apps_buffer_pos + 1) % APPS_MA_WINDOW_SIZE;

