FSLART/VCU_STM32_Firmware_V1/Core/Src/main.c
            // Check if precharge is complete
            // TODO fazer a diferenca entre a tensao do inversor e do bms e ver se esta a 90% reais
            if ((!vcu.ignition_switch_signal && !vcu.ignition_ad) || !vcu.shutdown_signal) {
                current_state = STATE_STANDBY;
                if (!vcu.shutdown_signal) {
                    current_state = STATE_SHUTDOWN;
                }
            } else if (Bypass_precharge || (bms.precharge_circuit_state == 9) || myHV500.Actual_InputVoltage > 450) {
                current_state = vcu.manual ? STATE_WAITING_FOR_R2D_MANUAL : STATE_WAITING_FOR_R2D_AUTO;
            }
            break;

        case STATE_WAITING_FOR_R2D_MANUAL:

            if (!vcu.ignition_switch_signal || !vcu.shutdown_signal) {
                current_state = STATE_STANDBY;
                if (!vcu.shutdown_signal) {
                    current_state = STATE_SHUTDOWN;
                }
                //} else if (vcu.r2d_toggle_signal && (Bypass_brake_pressure || vcu.brake_pressure > BRAKE_PRESSURE_THRESHOLD)) {
            } else if (Bypass_brake_pressure || vcu.brake_pressure > BRAKE_PRESSURE_THRESHOLD) {
                // Handle R2D button debounce
                debounce_r2d_button();
                if (vcu.r2d_toggle_signal) {
                    current_state = STATE_READY_MANUAL;
                }
            }
            break;

        case STATE_WAITING_FOR_R2D_AUTO:
            if (!vcu.ignition_ad || !vcu.shutdown_signal) {
                current_state = STATE_STANDBY;
                if (!vcu.shutdown_signal) {
                    current_state = STATE_SHUTDOWN;
                }
            } else if (as_system.state == 3) {  // driving state
                current_state = STATE_READY_AUTONOMOUS;
            }
            break;

        case STATE_READY_MANUAL:
            debounce_r2d_button();
            if (!vcu.ignition_switch_signal || !vcu.shutdown_signal) {
                // Change to standby if ignition is off
                current_state = STATE_STANDBY;
                if (!vcu.shutdown_signal) {
                    current_state = STATE_SHUTDOWN;
                }
            } else if (!vcu.r2d_toggle_signal) {
                // Change to waiting for R2D manual if the button is pressed again
                current_state = STATE_WAITING_FOR_R2D_MANUAL;
            }
            break;

        case STATE_READY_AUTONOMOUS:
            // serve as gateway to the computer to send the commands to the inverter
            if (!vcu.ignition_ad) {
                current_state = STATE_STANDBY;
            } else if (as_system.state != 3) {
                current_state = STATE_WAITING_FOR_R2D_AUTO;
            }

            // as_system.state = 5 finish autonoma

            // if (!vcu.ignition_ad || !vcu.shutdown_signal) {
            //     current_state = STATE_STANDBY;
            //     if (!vcu.shutdown_signal) {
            //         current_state = STATE_SHUTDOWN;
            //     }
            // } else if (as_system.state != 3) {
            //     current_state = STATE_WAITING_FOR_R2D_AUTO;
            // }
            break;

        case STATE_AS_EMERGENCY:
            // printf("\n\rAS Emergency: %d\n\r", as_system.state);

            if (!(acu.is_in_emergency) && !(as_system.state == 4) && !(res.signal == 0)) {
                current_state = STATE_STANDBY;
                if (!vcu.shutdown_signal) {
                    current_state = STATE_SHUTDOWN;
                }
            }

            // if (!vcu.ignition_ad || !vcu.shutdown_signal) {
            //     // current_state = STATE_STANDBY;
            //     // if (!vcu.shutdown_signal) {
            //     //     // so quando o tocar todo o som da emergencia é que vai para shutdown
            //     //     if (vcu.emergency_sound_completed) {
            //     //         current_state = STATE_SHUTDOWN;
            //     //     }
            //     // }
            // } else if (as_system.state != 4 && res.signal != 0) {
            //     current_state = STATE_STANDBY;
            // }

            // if (!vcu.ignition_ad || !vcu.shutdown_signal) {
            //     current_state = STATE_STANDBY;
            //     if (!vcu.shutdown_signal) {
            //         // so quando o tocar todo o som da emergencia é que vai para shutdown
            //         if (vcu.emergency_sound_completed) {
            //             current_state = STATE_SHUTDOWN;
            //         }
            //     }
            // } else if (as_system.state != 4 && res.signal != 0) {
            //     current_state = STATE_STANDBY;
            // }
            break;
    }

    // Execute entry actions when state has changed
    if (current_state != previous_state) {
#ifdef print_state
        print_state_transition(previous_state, current_state);
#endif
        // State entry actions
        switch (current_state) {
            case STATE_INIT:
                break;
            case STATE_SHUTDOWN:
            case STATE_STANDBY:
                can_bus_send_bms_precharge_state(0, &hcan2);
                // Reset critical flags when entering standby
                vcu.manual = false;
                vcu.autonomous = false;

                memset(&vcu, 0, sizeof(VCU_Signals_t));      // Reset all VCU signals
                memset(&as_system, 0, sizeof(AS_System_t));  // Reset autonomous system state
                memset(&acu, 0, sizeof(ACU_t));              // Reset ACU state
                // memset(&res, 0, sizeof(RES_t));              // Reset RES state
                // memset(&bms, 0, sizeof(BMSvars_t));  // Reset BMS variables
                memset(&myHV500, 0, sizeof(HV500));  // Reset HV500 variables

                vcu.r2d_button_signal = false;      // Reset R2D button signal
                vcu.r2d_toggle_signal = false;      // Reset R2D toggle signal
                vcu.r2d_autonomous_signal = false;  // Reset R2D autonomous signal
                ResetR2DSound();                    // Reset R2D sound state

                HAL_GPIO_WritePin(GPIOD, LED_IGN_Pin, GPIO_PIN_RESET);
                HAL_GPIO_WritePin(GPIOD, LED_R2D_Pin, GPIO_PIN_RESET);

                vcu.r2d_button_signal = false;                    // Reset R2D button signal
                __HAL_TIM_SET_COMPARE(&htim4, TIM_CHANNEL_1, 0);  // Set PWM to 0% duty cycle
                break;

            case STATE_PRECHARGE:
                // Precharge state entry actions
                HAL_GPIO_WritePin(GPIOD, LED_IGN_Pin, GPIO_PIN_SET);  // Turn on ignition LED debug
                __HAL_TIM_SET_COMPARE(&htim4, TIM_CHANNEL_1, 0);      // Set PWM to 0% duty cycle

                break;

            case STATE_WAITING_FOR_R2D_AUTO:
            case STATE_WAITING_FOR_R2D_MANUAL:

                HAL_GPIO_WritePin(GPIOD, LED_R2D_Pin, GPIO_PIN_RESET);  // Turn off R2D LED
                ResetR2DSound();                                        // Reset R2D sound state

                break;

            case STATE_READY_MANUAL:
            case STATE_READY_AUTONOMOUS:

