FSLART/VCU_STM32_Firmware_V1/Core/Src/main.c
            vcu.r2d_button_prev = stable_state;
        }
    }

    // Save the reading for next comparison
    last_reading = current_reading;

    // Update raw signal for any code that needs it
    vcu.r2d_button_signal = stable_state;
}

/* -------------------- TIMED TASK FUNCTIONS -------------------- */

/**
 * @brief Execute 10ms tasks (100Hz)
 * @details High-frequency tasks that need precise timing
 */
void execute_10ms_tasks(void) {
    // Send autonomous HV signal
    can_send_autonomous_HV_signal(&hcan3, bms.precharge_circuit_state);

    // Send heartbeat frame on CAN2
    uint8_t data[8] = {0};
    CAN_TxHeaderTypeDef TxHeader;
    TxHeader.StdId = 0x69;
    TxHeader.ExtId = 0;
    TxHeader.RTR = CAN_RTR_DATA;
    TxHeader.IDE = CAN_ID_STD;
    TxHeader.DLC = 8;
    TxHeader.TransmitGlobalTime = DISABLE;

    uint32_t TxMailbox;
    HAL_CAN_AddTxMessage(&hcan2, &TxHeader, data, &TxMailbox);

    // Process APPS (Accelerator Pedal Position Sensor)
    result = APPS_Process(apps2_avg, apps1_avg);

#if CALIBRATE_APPS
    // If calibration is in progress, update it
    if (APPS_IsCalibrating()) {
        bool calibration_complete = APPS_Calibrate(apps1_avg, apps2_avg);
        if (calibration_complete) {
            // Optionally, automatically apply the calibration
            uint16_t min, max, tolerance, delta;
            APPS_GetCalibrationValues(&min, &max, &tolerance, &delta);
            APPS_Init(min, max, tolerance, delta);
        }
    }
#endif

#if print_apps
    APPS_PrintStatus();
#endif
}

/**
 * @brief Execute 100ms tasks (10Hz)
 * @details Medium-frequency tasks for sensor reading and logging
 */
void execute_100ms_tasks(void) {
    // Read brake pressure from ADC
    vcu.brake_pressure = MeasureBrakePressure(ADC1_VAL[0]);
    turn_on_brake_light(vcu.brake_pressure);

    // Debug prints (uncomment if needed)
    // printf("\n\rBrake Pressure: %d\n\r", vcu.brake_pressure);
    // printf("\n\rbits ADC_brake_pressure: %d\n\r", ADC1_VAL[0]);

    // Send VCU telemetry frames in rotation (one different frame each time)
    static uint8_t frame_index = 0;

    switch (frame_index) {
        case 0:
            send_vcu_0(&hcan1);
            can_bus_send_brake_pressure(&hcan1, vcu.brake_pressure);
            break;
        case 1:
            send_vcu_1(&hcan1);
            break;
        case 2:
            send_vcu_2(&hcan1);
            break;
        case 3:
            send_vcu_3(&hcan1);
            break;
        case 4:
            send_vcu_4(&hcan1);
            break;
    }

    // Move to next frame for next execution (cycles through 0-4)
    frame_index = (frame_index + 1) % 5;
} /**
   * @brief Execute immediate tasks (every loop iteration)
   * @details Tasks that need to run as fast as possible
   */
void execute_immediate_tasks(void) {
    // Heartbeat LED indicator
    heartbeat_nonblocking(GPIOB, LED_Heartbeat_Pin);

    // Process CAN3 messages (autonomous bus)
    if (HAL_CAN_GetRxFifoFillLevel(&hcan3, CAN_RX_FIFO0) > 0) {
        CAN_RxHeaderTypeDef RxHeader;
        uint8_t RxData[8];
        if (HAL_CAN_GetRxMessage(&hcan3, CAN_RX_FIFO0, &RxHeader, RxData) == HAL_OK) {
            decode_auto_bus(RxHeader, RxData);
        }
    }

    // Update moving average with new APPS values
    MovingAverage_Update(ADC2_APPS[0], ADC2_APPS[1]);

    // Update state machine
    UpdateState();

    // Execute state-specific actions
    HandleState();
}

/* -------------------- COMMUNICATION FUNCTIONS -------------------- */

/**
 * @brief Redirect printf to UART
 */
PUTCHAR_PROTOTYPE {
    /* Place your implementation of fputc here */
    /* e.g. write a character to the USART1 and Loop until the end of transmission */
    HAL_UART_Transmit(&huart3, (uint8_t *)&ch, 1, 0xFFFF);

    return ch;
}

void HAL_CAN_RxFifo0MsgPendingCallback(CAN_HandleTypeDef *hcan) {
    // CAN_RxHeaderTypeDef RxHeader1;
    // uint8_t RxData1[8];
    CAN_RxHeaderTypeDef RxHeader2;
    uint8_t RxData2[8];
    // CAN_RxHeaderTypeDef RxHeader3;
    // uint8_t RxData3[8];

    if (HAL_CAN_GetRxMessage(&hcan2, CAN_RX_FIFO0, &RxHeader2, RxData2) == HAL_OK) {
        // if (RxHeader2.StdId == 0x14) {
        //    erpm_temporary = RxData2[0] << 24 | RxData2[1] << 16 | RxData2[2] << 8 | RxData2[3];
        //  printf("\n\rERPM: %d\n\r", erpm_temporary);
        //} else {
        //    can_filter_id_bus2(RxHeader2, RxData2);
        //}

        can_filter_id_bus2(RxHeader2, RxData2);
    }
}

/* USER CODE END 0 */

/**
 * @brief  The application entry point.
 * @retval int
 */
int main(void) {
    /* USER CODE BEGIN 1 */
    current_state = STATE_INIT;
    /* USER CODE END 1 */

    /* MPU Configuration--------------------------------------------------------*/
    MPU_Config();

    /* Enable the CPU Cache */

    /* Enable I-Cache---------------------------------------------------------*/
    SCB_EnableICache();

    /* Enable D-Cache---------------------------------------------------------*/
    SCB_EnableDCache();

    /* MCU Configuration--------------------------------------------------------*/

    /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
    HAL_Init();

    /* USER CODE BEGIN Init */

    // HAL_ADC_Start_DMA(&hadc3, (uint32_t *)&adc_buffer, 5);

    // HAL_ADC_Start(&hadc3);

    /* USER CODE END Init */

    /* Configure the system clock */
    SystemClock_Config();

    /* USER CODE BEGIN SysInit */

    /* USER CODE END SysInit */

    /* Initialize all configured peripherals */
    MX_GPIO_Init();
    MX_DMA_Init();
    MX_USART1_UART_Init();
    MX_ADC3_Init();
    MX_ADC1_Init();
    MX_ADC2_Init();
    MX_CAN3_Init();
    MX_CAN1_Init();
    MX_CAN2_Init();
    MX_TIM1_Init();
    MX_TIM4_Init();
    MX_USART3_UART_Init();
    /* USER CODE BEGIN 2 */

    // Configure filters with different banks
    CAN1_Filter_Config();
    CAN2_Filter_Config();
    CAN3_Filter_Config();

    // Enable interrupts for all
    if (HAL_CAN_ActivateNotification(&hcan1, CAN_IT_RX_FIFO0_MSG_PENDING) != HAL_OK) {
        Error_Handler();
    }
    if (HAL_CAN_ActivateNotification(&hcan2, CAN_IT_RX_FIFO0_MSG_PENDING) != HAL_OK) {
        Error_Handler();
    }
    if (HAL_CAN_ActivateNotification(&hcan3, CAN_IT_RX_FIFO0_MSG_PENDING) != HAL_OK) {
        Error_Handler();
    }

